<?php
//企业发放的奖金根据利润提成。利润（I）低于或等于10万元时，奖金可提10% ； 利润高于10 万元， 低于20 万元时， 低于10万
//元的部分按10% 提成，高于 10万元的部分，可提成7.5%；20万到40 万之间时，高于20 万元的部分，可提成5%； 高于40 万元的部分， 可提成1%,
//从键盘输入当月利润I，求应发放奖金总数？(利用if else if)

$I = 400000;
$p = 0;
$num1 = 100000 * 0.1;
$num2 = 100000 * 0.75;
$num3 = 200000 * 0.5;

if ($I <= 100000) {
    $p = $I * 0.1;
} else if ($I <= 200000) {
    $p = $num1 + ($I - 100000) * 0.075;
} else if ($I <= 400000) {
    $p = $num1 + $num2 + ($I - 200000) * 0.05;
} else if ($I > 400000) {
    $p = $num1 + $num2 + $num3 + ($I - 400000) * 0.01;
} else
    echo "输入错误";

echo '奖金为：' . $p;